## Ordinal Number Encoding

### * Grading system or rank system

In [2]:
import datetime

In [12]:
today_date=datetime.datetime.today()

In [13]:
today_date

datetime.datetime(2021, 1, 29, 10, 52, 4, 223786)

#### list comprehension are more usefull in data science

In [30]:
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [31]:
import pandas as pd
data = pd.DataFrame(days)
data.columns = ["Day"]

In [32]:
data.head(16)

                          Day
0  2021-01-29 10:52:04.223786
1  2021-01-28 10:52:04.223786
2  2021-01-27 10:52:04.223786
3  2021-01-26 10:52:04.223786
4  2021-01-25 10:52:04.223786
5  2021-01-24 10:52:04.223786
6  2021-01-23 10:52:04.223786
7  2021-01-22 10:52:04.223786
8  2021-01-21 10:52:04.223786
9  2021-01-20 10:52:04.223786
10 2021-01-19 10:52:04.223786
11 2021-01-18 10:52:04.223786
12 2021-01-17 10:52:04.223786
13 2021-01-16 10:52:04.223786
14 2021-01-15 10:52:04.223786

In [33]:
data['Day'].dt.weekday_name

AttributeError: 'DatetimeProperties' object has no attribute 'weekday_name'

### Count or Frequency Encoding

In [108]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [109]:
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [110]:
##define how many columns do you need

columns=[1,3,5,6,7,8,9,13]

In [113]:
## asign the columns values to dataset

train_set=train_set[columns]

In [114]:
## giving feature name i mean renaming the feature name

train_set.columns =["Employment",'Degree','Satus','Desgination','family_job','Race','Sex','Country']

In [115]:
train_set.head()

          Employment      Degree  ...      Sex         Country
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [116]:
train_set.isnull().sum()

#data is clean which means no missing datas in it

Employment     0
Degree         0
Satus          0
Desgination    0
family_job     0
Race           0
Sex            0
Country        0
dtype: int64

In [117]:
## printing how many unique labels in every feature

for col in train_set.columns[:]:
    print(col,":",len(train_set[col].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Satus : 7 labels
Desgination : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [118]:
## changing into dictionaryu
country_map=train_set['Country'].value_counts().to_dict()

In [119]:
#mapping the count value to that particular varibales

train_set['Country']=train_set['Country'].map(country_map)

<ipython-input-119-e686c1891ad5>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_set['Country']=train_set['Country'].map(country_map)

In [120]:
train_set.head()

          Employment      Degree                Satus  ...    Race      Sex Country
0          State-gov   Bachelors        Never-married  ...   White     Male   29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   29170
2            Private     HS-grad             Divorced  ...   White     Male   29170
3            Private        11th   Married-civ-spouse  ...   Black     Male   29170
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female      95

[5 rows x 8 columns]


### Advantage

* Easy to Use 
* Not increasing feature space

### Disadvantage

* It will provide same weight if the freqeuncies are same


# Target Guided Ordinal Encoding

* Ordering the labels according to  the target
* Replace the labels by the joint probability of being 1 or 0

In [122]:
import pandas as pd
df =pd.read_csv('titanic_train.csv', usecols=['Cabin','Survived'])

In [123]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [124]:
df['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [125]:
df['Cabin'].fillna('missing',inplace=True)

In [136]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [141]:
df['Cabin'].unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [147]:
## we r grouping the cabin and survived bcos if he survived only we can know cabin 
# based on that we r making probability function mean


df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [148]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [149]:
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [156]:
ordinal_labels2={k:i for i , k in enumerate(ordinal_labels,0)}

In [157]:
ordinal_labels2 # we giving rank

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [159]:

df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [160]:
df.head()

   Survived Cabin Cabins  Cabin_ordinal_labels
0         0     m      m                     1
1         1     C      C                     4
2         1     m      m                     1
3         1     C      C                     4
4         0     m      m                     1

In [162]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [163]:
df['mean_ordinal_encoding']=df['Cabin'].map(mean_ordinal)

In [164]:
df.head()

   Survived Cabin Cabins  Cabin_ordinal_labels  mean_ordinal_encoding
0         0     m      m                     1               0.299854
1         1     C      C                     4               0.593220
2         1     m      m                     1               0.299854
3         1     C      C                     4               0.593220
4         0     m      m                     1               0.299854

In [165]:
# above mean_ordinal encoidng relate the monotonic relationship